tap "aws/tap"
tap "common-fate/granted"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "kong/deck"
tap "shivammathur/php"
brew "act"
brew "jpeg-xl"
brew "aom"
brew "pycparser"
brew "cffi"
brew "aws-sam-cli"
brew "aws-sso-util"
brew "awscli"
brew "awsdac"
brew "awsume"
brew "glib"
brew "chezmoi"
brew "cmake"
brew "dfu-util"
brew "direnv"
brew "docutils"
brew "duckdb"
brew "dynein"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "jq"
brew "just"
brew "libfido2"
brew "libmagic"
brew "llm"
brew "mas"
brew "mise"
brew "mysql-client"
brew "ninja"
brew "nmap"
brew "openjdk"
brew "pandoc"
brew "pipenv"
brew "plantuml"
brew "pnpm"
brew "python@3.11"
brew "qemu"
brew "redis"
brew "rye"
brew "sshpass"
brew "tbls"
brew "tenv"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "zsh-completions"
brew "kong/deck/deck"
brew "shivammathur/php/php@7.4"
cask "1password-cli"
cask "alfred"
cask "amazon-q"
cask "aws-vpn-client"
cask "bettertouchtool"
cask "cursor"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "firefox"
cask "font-ricty-diminished"
cask "gather"
cask "gcloud-cli"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keepingyouawake"
cask "logitech-camera-settings"
cask "macvim-app"
cask "microsoft-teams"
cask "mqttx"
cask "ngrok"
cask "obsidian"
cask "postman"
cask "rancher"
cask "rar"
cask "session-manager-plugin"
cask "skitch"
cask "slack"
cask "switchhosts"
cask "typora"
cask "visual-studio-code"
cask "vnc-viewer"
cask "xmind"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "corschenzi.mermaid-graphical-editor"
vscode "csholmq.excel-to-markdown-table"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "kddejong.vscode-cfn-lint"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "marp-team.marp-vscode"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "platformio.platformio-ide"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "undefined_publisher.devio-extension"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yahyabatulu.vscode-markdown-alert"
